---
kind: property
id: P:Autodesk.Revit.DB.CurtainGridSet.Size
source: html/5471d960-395e-816d-6d02-928d089f483e.htm
---
# Autodesk.Revit.DB.CurtainGridSet.Size Property

Returns the number of objects that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```